resume/resume.org
#+TITLE: Chen Yewei
#+KEYWORDS: Resume, Chen Yewei, ChrisChen3121
#+OPTIONS: H:2 toc:nil num:nil ^:nil
#+BEGIN_CENTER
13651824760\\
ChrisChen3121@gmail.com\\
ChrisChen3121@Github\\
#+END_CENTER

* _Objective_
#+BEGIN_VERSE
Being a useful part of well-reputed organization to enhance my 
skills in order to accept the challenges. Looking for opportunities 
to work with smart people.
#+END_VERSE

* _Skills_
- Proficient in C++, C#, basic knowledge of Python, Java, ELisp(Emacs).
- SQL, XML Schema, XPath, XQuery, XSLT, Regular Expression.
- Strong object-oriented skills.
- Knowledge of database design.
- Basic knowledge of operating system, computer network.
- Experienced in Linux and various system command tools.

* _Experience_
** 6 years at Shanghai Kohden
#+BEGIN_VERSE
Healthcare, Japanese-funded, ECG&EEG Market domination in China.
#+END_VERSE

** /2012.11-present/ Team Leader
- Led a team of five developers.
- Served as a core member of company code-review group.
- Served as an administrator of redmine server(linux) serving for the whole company.
- ECG Management Information System
  - Keep refactoring code to make system easy to extend.
  - Developed procedures to standardize development and testing.
  - Trained team members to develop automated tests.

** /2011.9-2012.10/ System Engineer
- Prepared and delivered pre-sales presentations for end users.
- After-sales deployment(Windows Server, IIS).
- Analysed requirements from end users.
- Implemented the interface for integration with various HISs(Hospital Information System).

** /2008.7-2011.8/ Software Engineer
- ECG Management Information System(.Net)
  - Participated in the entire system designation process.
  - Implement the communication module which provids data exchange with EKG devices(socket).
  - Design and implement the APIs for integration with other systems(Web Service, XML).

- EEG Diagnositic System(MFC)
  - Implement the print module.
  - Implement a real-time module for monitoring and recording patient's reaction.

* _Language_
- English CET6
- Japenese JLPT N2

* _Education_
** 2004-2008: Shanghai Institute of Technology
- Bachelor degree in Mechanical Design Manufacturing and Automation

  (jointly sponsored by Central Michigan University, USA)

** Coursera Learner
- Algorithms, Princeton University
- Introduction to Databases, Stanford University
- Computer Networks, University of Washington
- Practice on Programming, Peking University
