resume.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chen Yewei</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chen Yewei"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-05-05T13:33+0800"/>
<meta name="author" content="ChrisChen"/>
<meta name="description" content=""/>
<meta name="keywords" content="Resume, Chen Yewei, ChrisChen3121"/>

</head>
<body>


<div id="content">
<h1 class="title">Chen Yewei</h1>


<div style="text-align: center">
<p>13651824760<br/>
ChrisChen3121@gmail.com<br/>
ChrisChen3121@Github<br/>
</p>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span style="text-decoration:underline;">Objective</span></h2>
<div class="outline-text-2" id="text-1">


<p class="verse">
Being a useful part of well-reputed organization to enhance my <br/>
skills in order to accept the challenges. Looking for opportunities <br/>
to work with smart people.<br/>
</p>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span style="text-decoration:underline;">Skills</span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Proficient in C++, C#, basic knowledge of Python, Java, ELisp(Emacs).
</li>
<li>SQL, XML Schema, XPath, XQuery, XSLT, Regular Expression.
</li>
<li>Familiar with design pattern.
</li>
<li>Basic knowledge of operating system, computer network.
</li>
<li>Knowledge of database design.
</li>
<li>Experienced in Linux and various system command tools.
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span style="text-decoration:underline;">Experience</span></h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">6 years at Shanghai Kohden</h3>
<div class="outline-text-3" id="text-3-1">


<p class="verse">
Healthcare, Japanese-funded, ECG&amp;EEG Market domination in China.<br/>
</p>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><i>2012.11-present</i> Team Leader</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>Led a team of five developers.
</li>
<li>Served as a core member of company code-review group.
</li>
<li>Served as an administrator of redmine server(linux) serving for the whole company.
</li>
<li>ECG Management Information System
<ul>
<li>Keep refactoring code to make system easy to extend.
</li>
<li>Developed procedures to standardize development and testing.
</li>
<li>Trained team members to develop automated tests.
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><i>2011.9-2012.10</i> System Engineer</h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>Prepared and delivered pre-sales presentations for end users.
</li>
<li>After-sales deployment(Windows Server, IIS).
</li>
<li>Analysed requirements from end users.
</li>
<li>Implemented the interface for integration with various HISs(Hospital Information System).
</li>
</ul>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><i>2008.7-2011.8</i> Software Engineer</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>ECG Management Information System(.Net)
<ul>
<li>Participated in the entire system designation process.
</li>
<li>Implement the communication module which provids data exchange with EKG devices(socket).
</li>
<li>Design and implement the APIs for integration with other systems(Web Service, XML).

</li>
</ul>

</li>
<li>EEG Diagnositic System(MFC)
<ul>
<li>Implement the print module.
</li>
<li>Implement a real-time module for monitoring and recording patient's reaction.
</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span style="text-decoration:underline;">Language</span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>English CET6
</li>
<li>Japenese JLPT N2
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span style="text-decoration:underline;">Education</span></h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">2004-2008: Shanghai Institute of Technology</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>Bachelor degree in Mechanical Design Manufacturing and Automation

<p>
  (jointly sponsored by Central Michigan University, USA)
</p></li>
</ul>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">Coursera Learner</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>Algorithms, Princeton University
</li>
<li>Introduction to Databases, Stanford University
</li>
<li>Computer Networks, University of Washington
</li>
<li>Practice on Programming, Peking University
</li>
</ul>

</div>
</div>
</div>
</div>

</body>
</html>
